##Python

In [1]:
import pandas as pd
df = pd. read_csv(r"D:\Python\20-hour-Python\Python-C1\Sales.csv")
df.head()

  Customer  Product   Amount
0      Raj   Laptop  50000.0
1    Meera    Phone      NaN
2    Arjun      NaN  30000.0
3    Priya   Tablet  25000.0
4      NaN    Phone  15000.0

In [2]:
dfclean = df.dropna()
dfclean

  Customer  Product   Amount
0      Raj   Laptop  50000.0
3    Priya   Tablet  25000.0

In [7]:
total_sales = dfclean[' Amount'].sum()
total_sales

np.float64(75000.0)

In [9]:
transactions = dfclean[' Amount'].count()
transactions

np.int64(2)

In [11]:
avg_sales = dfclean[' Amount'].mean()
avg_sales

np.float64(37500.0)

In [14]:
summary = {
    'Total Sales': total_sales,
    'Transactions' : transactions,
    'Average Sales' : avg_sales
}

df1 = pd.DataFrame(summary,index=[0])
df1

   Total Sales  Transactions  Average Sales
0      75000.0             2        37500.0

In [15]:
df1.to_csv("summary.csv")